package com.example.task.utils

import com.example.task.R

object NewsFeedResourcesRepository {

    val headerList : List<String> = listOf(
        "Новый рекорд на Олимпийских играх: пловец побил свой личный рекорд",
        "Вулкан на острове проснулся после многолетней спячки",
        "Ученые нашли новый метод лечения рака",
        "В музее открылась выставка редких артефактов древней цивилизации",
        "Научные исследования подтвердили пользу сна на открытом воздухе"
    )

    val bodyList : List<String> = listOf(
        "На Олимпийских играх проходит ряд ярких событий. Вчера пловец Иван Петров побил свой личный рекорд на дистанции 100 метров баттерфляем. Его результат составил 52,45 секунды, что на 0,2 секунды лучше предыдущего показателя.",
        "На острове Зеленый вулкан, который был в спячке более 50 лет, вновь проявил активность. Из кратера поднимается столб пепла, а извержения сопровождаются громкими звуками и осадками. Власти рекомендуют местным жителям и туристам оставаться на безопасном расстоянии от вулкана.",
        "Международная группа ученых сообщила о новом перспективном методе лечения рака. Проведенные на лабораторных мышах эксперименты показали, что новые препараты успешно уничтожают раковые клетки без негативного воздействия на здоровые ткани. В ближайшее время планируется начать клинические испытания.",
        "В одном из крупных музеев страны открылась уникальная выставка, где посетители смогут увидеть редкие артефакты древней цивилизации, которая существовала более 2000 лет назад. Среди экспонатов - украшения, оружие и предметы быта, рассказывающие о жизни и культуре этого народа.",
        "Недавнее исследование, проведенное учеными, показало, что сон на открытом воздухе оказывает положительное влияние на здоровье человека. Уже после нескольких ночей проведенных на природе, испытуемые отметили улучшение сна, повышение энергии и общего самочувствия."
    )

    val imageList : List<Int> = listOf(
        R.drawable.first_image,
        R.drawable.second_image,
        R.drawable.third_image
    )

}